000010*****************************************************************
000020* COPYBOOK: CONSTANT                                           *
000030* PROPOSITO: CONSTANTES DEL SISTEMA DE BIBLIOTECA              *
000040* AUTOR: KC03C9E                                               *
000050* FECHA: 09/11/2025                                            *
000060* VERSION: 1.0                                                 *
000070*****************************************************************
000080* DEFINICION DE CONSTANTES GENERALES                           *
000090*****************************************************************
001000 01 CONSTANTES-SISTEMA.
001010    05 CONST-NOMBRE-SISTEMA PIC X(40)
001020       VALUE 'SISTEMA BIBLIOTECA UNIVERSITARIA'.
001030    05 CONST-VERSION        PIC X(5)
001040       VALUE 'V1.0'.
001050    05 CONST-AUTOR          PIC X(25)
001060       VALUE 'KC03C9E'.
